app/controllers/testqs_controller.rb

SELECT "testqs".* FROM "testqs"
---
  def index
    @testqs = Testq.all

INSERT INTO "testqs" ("countq", "nowq", "commentq", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["countq", 1], ["nowq", 1], ["commentq", "1"], ["created_at", "2022-09-15 11:45:37.134091"], ["updated_at", "2022-09-15 11:45:37.134091"]]
---
  def create
    @testq = Testq.new(testq_params)
    respond_to do |format|
      if @testq.save

DELETE FROM "testqs" WHERE "testqs"."id" = ?  [["id", 3]]
---
  def destroy
    @testq.destroy

SELECT "testqs".* FROM "testqs" WHERE "testqs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_testq
      @testq = Testq.find(params[:id])