app/jobs/simplejob.rb

SELECT "testqs".* FROM "testqs" WHERE "testqs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "testqs" SET "commentq" = ?, "updated_at" = ? WHERE "testqs"."id" = ?  [["commentq", "r, 0"], ["updated_at", "2022-09-16 04:00:47.788772"], ["id", 4]]
---
  def self.perform(mass)
    # здесь делаем важные и полезные вещи
    testq = Testq.find(mass[0])
    p "---#{testq.inspect}---"
    testq.commentq="#{testq.commentq}, #{mass[1]}"
    testq.save